'''
지금까지 여러분이 짠 코드는 무조건 실행되고 있습니다.

근데 가끔은 이게 마음에 안들 경우가 있습니다.

매번 실행하는게 아니라 특정 조건이 맞을 때(전문 용어로 아다리가 맞을 때)만 실행하고 싶은 경우가 있습니다.

그럴 땐 if 라는 문법을 씁니다. 
'''


# if 문

# if 조건식 : 
#   실행할코드


# 중고차재고 = ['K5', 'BMW', 'Tico']
# if 'K5' in 중고차재고 : 
#   print('지금주문가능합니다~')


# 재고량 = 0
# if 재고량 > 0 : 
#   print('지금 주문가능합니다~')
# else : 
#   print('재고량이 없네요 주문불가능함 ㅅㄱ')


'''
(참고) 실은 elif 라는 문법도 있습니다.

조건식을 여러개 검사하고 싶을 떄, if문을 연달아서 두번 세번 쓰고싶을 때 쓰는 문법입니다. 

심심하면 검색으로 알아보도록 합시다. 

(참고2) 조건식이 참일 때 여러 줄의 코드를 실행하고 싶으면 그냥 실행하고 싶은 모든 코드를 indent 넣고 두줄 세줄 네줄 계속 작성해주시면 됩니다. 
'''